src/Enums/onyx_ТипЗапроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>onyx_ТипЗапроса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПолучениеСпискаАгентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеАгента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеСессии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаСообщения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеСессии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/onyx_ТипОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>onyx_ТипОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПолучениеТокена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеСпискаАгентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеАгента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеСессии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаСообщения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеСессии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/onyx_РаботаСАгентами/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Публичный программный интерфейс

// Возвращает список ссылок на агентов. При необходимости выполняет синхронизацию с API.
//
// Параметры:
//   ОбновитьКэш - Булево - при Истина всегда обращается к API Onyx (необязательный).
//
// Возвращаемое значение:
//   Массив - ссылки на элементы справочника `onyx_Агенты`.
Функция ПолучитьСписокАгентов(ОбновитьКэш = Ложь) Экспорт
	
	Если Не ОбновитьКэш Тогда
		Возврат ПолучитьАгентовИзСправочника();
	КонецЕсли;
	
	Агенты = ПолучитьАгентовИзAPI();
	
	Если Агенты.Количество() = 0 Тогда
		Возврат ПолучитьАгентовИзСправочника();
	КонецЕсли;
	
	Возврат Агенты;
	
КонецФункции

// Возвращает ссылку на агента по идентификатору Onyx.
//
// Параметры:
//   ИдентификаторАгента - Число - идентификатор агента Onyx.
//   Обновить - Булево - при Истина данные обновляются из API (необязательный).
//
// Возвращаемое значение:
//   СправочникСсылка.onyx_Агенты - найденный агент или Неопределено.
Функция ПолучитьАгентаПоИД(ИдентификаторАгента, Обновить = Ложь) Экспорт
	
	Ссылка = Справочники.onyx_Агенты.НайтиПоИдентификатору(ИдентификаторАгента);
	
	Если Не Обновить И ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Ссылка;
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ТипЗапроса", Перечисления.onyx_ТипЗапроса.ПолучениеАгента);
	ПараметрыЗапроса.Вставить("ТипОперации", Перечисления.onyx_ТипОперации.ПолучениеАгента);
	
	Ответ = onyx_ПодключениеКAPI.ВыполнитьЗапрос(
		"GET",
		"persona/" + Строка(ИдентификаторАгента),
		ПараметрыЗапроса);
	
	Если ТипЗнч(Ответ.Данные) <> Тип("Структура") И ТипЗнч(Ответ.Данные) <> Тип("Соответствие") Тогда
		Возврат Ссылка;
	КонецЕсли;
	
	Возврат Справочники.onyx_Агенты.СоздатьИлиОбновить(Ответ.Данные);
	
КонецФункции

// Принудительная синхронизация агента по ссылке.
//
// Параметры:
//   СсылкаНаАгента - СправочникСсылка.onyx_Агенты - ссылка на элемент для обновления.
Процедура СинхронизироватьАгента(СсылкаНаАгента) Экспорт
	
	Если Не ЗначениеЗаполнено(СсылкаНаАгента) Тогда
		Возврат;
	КонецЕсли;
	
	Идентификатор = Справочники.onyx_Агенты.ПолучитьИдентификатор(СсылкаНаАгента);
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	ПолучитьАгентаПоИД(Идентификатор, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Вспомогательные функции

// Возвращает массив ссылок на агентов, сохраненных в справочнике.
//
// Возвращаемое значение:
//   Массив - ссылки на элементы справочника `onyx_Агенты`.
Функция ПолучитьАгентовИзСправочника() Экспорт
	
	Возврат Справочники.onyx_Агенты.ПолучитьСписок();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Частные процедуры и функции

// Выполняет загрузку агентов из API Onyx и возвращает ссылки на обновленные элементы.
//
// Возвращаемое значение:
//   Массив - ссылки на элементы справочника `onyx_Агенты`.
Функция ПолучитьАгентовИзAPI()
	
	Ссылки = Новый Массив;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ТипЗапроса", Перечисления.onyx_ТипЗапроса.ПолучениеСпискаАгентов);
	ПараметрыЗапроса.Вставить("ТипОперации", Перечисления.onyx_ТипОперации.ПолучениеСпискаАгентов);
	
	Ответ = onyx_ПодключениеКAPI.ВыполнитьЗапрос(
		"GET",
		"persona",
		ПараметрыЗапроса);
	
	Если ТипЗнч(Ответ.Данные) <> Тип("Массив") Тогда
		Возврат Ссылки;
	КонецЕсли;
	
	Для Каждого АгентИзAPI Из Ответ.Данные Цикл
		Ссылка = Справочники.onyx_Агенты.СоздатьИлиОбновить(АгентИзAPI);
		Если ЗначениеЗаполнено(Ссылка) Тогда
			Ссылки.Добавить(Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	// Дополнительных действий не требуется, т.к. каждая запись агентов содержит дату синхронизации.
	
	Возврат Ссылки;
	
КонецФункции


#КонецОбласти
